<a href="https://colab.research.google.com/github/luisbezerra1/Data-Science-/blob/master/Missing_Values.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Relatório de Análise V

In [0]:
import pandas as pd

In [0]:
dados = pd.read_csv('aluguel.csv',sep= ';')

In [105]:
dados.head(10)

                      Tipo           Bairro  ...  Condominio    IPTU
0                Quitinete       Copacabana  ...       500.0    60.0
1                     Casa  Jardim Botânico  ...         NaN     NaN
2  Conjunto Comercial/Sala  Barra da Tijuca  ...      4020.0  1111.0
3              Apartamento           Centro  ...       390.0    20.0
4              Apartamento     Higienópolis  ...       230.0     NaN
5              Apartamento     Vista Alegre  ...         NaN     NaN
6              Apartamento         Cachambi  ...       301.0    17.0
7       Casa de Condomínio  Barra da Tijuca  ...         NaN     NaN
8       Casa de Condomínio            Ramos  ...         NaN     NaN
9  Conjunto Comercial/Sala           Centro  ...     19193.0  3030.0

[10 rows x 9 columns]

Eliminando valores nulos de uma serie

In [106]:
dados.isnull()

        Tipo  Bairro  Quartos  Vagas  Suites   Area  Valor  Condominio   IPTU
0      False   False    False  False   False  False  False       False  False
1      False   False    False  False   False  False  False        True   True
2      False   False    False  False   False  False  False       False  False
3      False   False    False  False   False  False  False       False  False
4      False   False    False  False   False  False  False       False   True
...      ...     ...      ...    ...     ...    ...    ...         ...    ...
32955  False   False    False  False   False  False  False       False  False
32956  False   False    False  False   False  False  False       False  False
32957  False   False    False  False   False  False  False       False  False
32958  False   False    False  False   False  False  False       False   True
32959  False   False    False  False   False  False  False       False  False

[32960 rows x 9 columns]

In [107]:
dados.notnull()

       Tipo  Bairro  Quartos  Vagas  Suites  Area  Valor  Condominio   IPTU
0      True    True     True   True    True  True   True        True   True
1      True    True     True   True    True  True   True       False  False
2      True    True     True   True    True  True   True        True   True
3      True    True     True   True    True  True   True        True   True
4      True    True     True   True    True  True   True        True  False
...     ...     ...      ...    ...     ...   ...    ...         ...    ...
32955  True    True     True   True    True  True   True        True   True
32956  True    True     True   True    True  True   True        True   True
32957  True    True     True   True    True  True   True        True   True
32958  True    True     True   True    True  True   True        True  False
32959  True    True     True   True    True  True   True        True   True

[32960 rows x 9 columns]

In [108]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32960 entries, 0 to 32959
Data columns (total 9 columns):
Tipo          32960 non-null object
Bairro        32960 non-null object
Quartos       32960 non-null int64
Vagas         32960 non-null int64
Suites        32960 non-null int64
Area          32960 non-null int64
Valor         32943 non-null float64
Condominio    28867 non-null float64
IPTU          22723 non-null float64
dtypes: float64(3), int64(4), object(2)
memory usage: 2.3+ MB

In [109]:
dados[dados['Valor'].isnull()]

                              Tipo                   Bairro  ...  Condominio    IPTU
76                     Apartamento          Barra da Tijuca  ...       970.0    68.0
2186                   Apartamento                     Leme  ...       878.0     NaN
2456                          Casa             Campo Grande  ...         NaN     NaN
2646                    Loja/Salão          Barra da Tijuca  ...         NaN     NaN
2941                   Apartamento                 Botafogo  ...      1010.0   170.0
2973                   Apartamento               Copacabana  ...       850.0     NaN
6598                    Loja/Salão                  Andaraí  ...         NaN  1140.0
7302                          Casa             Campo Grande  ...         NaN     NaN
12683                  Apartamento                     Leme  ...       878.0     NaN
13229                  Apartamento                   Glória  ...       910.0   228.0
13525                  Apartamento                    Gávea  ...       880.0   221.0
13579      Conjunto Comercial/Sala                 Botafogo  ...        10.0     NaN
20948      Conjunto Comercial/Sala  Freguesia (Jacarepaguá)  ...       500.0    74.0
21822  Loja Shopping/ Ct Comercial          Barra da Tijuca  ...      3600.0  1390.0
23056      Conjunto Comercial/Sala                 Botafogo  ...        10.0     NaN
24805      Conjunto Comercial/Sala                 Botafogo  ...        10.0     NaN
29166      Conjunto Comercial/Sala                 Botafogo  ...        10.0     NaN

[17 rows x 9 columns]

In [110]:
A = dados.shape[0]
dados.dropna(subset= ['Valor'], inplace= True)
B = dados.shape[0]
A-B

17

In [111]:
dados[dados['Valor'].isnull()]

Empty DataFrame
Columns: [Tipo, Bairro, Quartos, Vagas, Suites, Area, Valor, Condominio, IPTU]
Index: []

In [112]:
dados[dados['Condominio'].isnull()].shape[0]

4089

In [0]:
selecao = (dados['Tipo'] == 'Apartamento') & (dados['Condominio'].isnull())

In [114]:
A = dados.shape[0]
dados = dados[~selecao]
B = dados.shape[0]
A-B

745

In [115]:
dados[dados['Condominio'].isnull()].shape[0]

3344

In [0]:
a = dados.Condominio.mean()

In [0]:
dados = dados.fillna({'Condominio':a,'IPTU':0})

In [118]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32198 entries, 0 to 32959
Data columns (total 9 columns):
Tipo          32198 non-null object
Bairro        32198 non-null object
Quartos       32198 non-null int64
Vagas         32198 non-null int64
Suites        32198 non-null int64
Area          32198 non-null int64
Valor         32198 non-null float64
Condominio    32198 non-null float64
IPTU          32198 non-null float64
dtypes: float64(3), int64(4), object(2)
memory usage: 2.5+ MB

In [119]:
dados.head()

                      Tipo           Bairro  ...   Condominio    IPTU
0                Quitinete       Copacabana  ...   500.000000    60.0
1                     Casa  Jardim Botânico  ...  2388.773896     0.0
2  Conjunto Comercial/Sala  Barra da Tijuca  ...  4020.000000  1111.0
3              Apartamento           Centro  ...   390.000000    20.0
4              Apartamento     Higienópolis  ...   230.000000     0.0

[5 rows x 9 columns]

In [0]:
dados.to_csv('Novo_aluguel.csv')